Revit 2027 API
ProjectPosition Constructor
Overload List
Name | Description
ProjectPosition(ProjectPosition) |  Creates a copy of the ProjectPosition.
ProjectPosition(Double, Double, Double, Double) |  Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation.
Top
See Also
Reference
ProjectPosition Class
Autodesk.Revit.DB Namespace